# Data Wrangling: Join, Combine, and Reshape

***

Author: Jiacheng

Date: 2019-05-17

***

In [1]:
import numpy as np
import pandas as pd

---

## 1 Hierarchical Indexing
## 层次化索引

* ### 1. 层次化入门

In [2]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [3]:
data

a  1    1.353601
   2   -1.321875
   3   -0.152124
b  1    0.632364
   3    1.766706
c  1    0.642660
   2   -1.518922
d  2   -0.845785
   3   -0.082289
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
# 部分索引
data['b']

1    0.632364
3    1.766706
dtype: float64

In [7]:
data['b':'d']

b  1    0.632364
   3    1.766706
c  1    0.642660
   2   -1.518922
d  2   -0.845785
   3   -0.082289
dtype: float64

In [8]:
data.loc[['b', 'd']]

b  1    0.632364
   3    1.766706
d  2   -0.845785
   3   -0.082289
dtype: float64

In [9]:
# 取出各部分第二项
data.loc[:, 2]

a   -1.321875
c   -1.518922
d   -0.845785
dtype: float64

In [10]:
# 形成DataFrame
data.unstack()

          1         2         3
a  1.353601 -1.321875 -0.152124
b  0.632364       NaN  1.766706
c  0.642660 -1.518922       NaN
d       NaN -0.845785 -0.082289

In [11]:
# 逆运算
data.unstack().stack()

a  1    1.353601
   2   -1.321875
   3   -0.152124
b  1    0.632364
   3    1.766706
c  1    0.642660
   2   -1.518922
d  2   -0.845785
   3   -0.082289
dtype: float64

In [12]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                             ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
# 指定index的名称
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [14]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

* ### 2. 根据级别汇总统计

In [16]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [18]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

* ### 3. 使用DataFrame的列进行索引

In [19]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [20]:
# 将某列转换为行索引
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1